public class Primitives {

    //boolean: хранит значение true или false
    boolean isActive = false;
    boolean isAlive = true;

    //byte: хранит целое число от -128 до 127 и занимает 1 байт
    byte t = 1;

    //short: хранит целое число от -32768 до 32767 и занимает 2 байта
    short s = 8;

    //int: хранит целое число от -2147483648 до 2147483647 и занимает 4 байта
    int i = 6;

    //long: хранит целое число от –9 223 372 036 854 775 808 до 9 223 372 036 854 775 807 и занимает 8 байт
    long l = 88;

    //double: хранит число с плавающей точкой от ±4.9*10-324 до ±1.7976931348623157*10308 и занимает 8 байт
    double d = 3.5;

    //float: хранит число с плавающей точкой от -3.4*1038 до 3.4*1038 и занимает 4 байта
    float f = 0.7F;

    //char: хранит одиночный символ в кодировке UTF-16 и занимает 2 байта, поэтому диапазон хранимых значений от 0 до 65535
    char ch = 's';
}
